# Текстовый квест от Рамира Александрова

print('Привет, ты попал в мой первый квест. Тута ты получишь в конце жесткий БДСМ от меня в качесве оператора')
print('Ты появился в каком-то помещении, можешь начинать!')
print('Ну перед тобой 3 дверки с номерами: 1, 2, 3.')
a = int(input())
b = c = d = e = 0
if a == 1:
    print('Ты вошёл комнату и ловушка не заставила себя ждать. Ботик))))))))')
elif a == 3:
    print('Ты споткнулся и упал в руки к бабушке Гренни. Я тебе не дам возможность ее убить')
if a == 2:
    print('Ты в новой комнате.')
    print('Выход будет в одной из двух дверей.')
    print('Первая дверь справа, а  вторая дверь.')
    print('Крч найди выход отсюда в правой или левой двери')
    b = input()
    if b == 'в правой':
        print('Ты сюда зашел и тебя смачно изнасиловали. Бот..... Научись играть')
    elif b == 'в левой':
        print('Ты в третьей комнате.')
        print('Здесь также как и в начале три двери. 4, 5, 6. Догадайся что нужно ввести.))))))')
c = int(input())
if c == 5:
    print('Огромный фаллоимитатор пронзил тебя. Зато умер весело)))))))))).')
elif c == 6:
    print('Ты зашел в комнату. Молодец. Тебя убила Шелли с ультой из БРАВЛ СТАРС!!!!!!!')
elif c == 4:
    print('Ты попал уже в комнату под номером 4. Жалко, что БДСМ не состоялся....... Но ты прошёл, '
          'что очень-очень-очень плохо.')
    print('Если хочешь лютый БДСМ с Лешей в качестве жертвы, то скорей вводи пароль - "8642Ручка ******** бобра" '
          'скопируй его так проще')
    d = input()
    if d == '8642Ручка ******** бобра':
        print('Жесткий БДСМ С Лешей находиться где-то впереди. Я слишком гениален ведь в моем квесте есть только '
              'текст и больше никаких картинок так что тут only рандом. Также три двери с номерами 7, 8, 9')
    e = int(input())
if e == 7:
    print('Тут комната и тут тебя ждет БДСМ только вот не ты смотреть будешь на Леху, а он на тебя. '
          'ХХАХПХАХХПАХХПАПХХАХПХПХХПХПХПХАХПХАХАХАПХАХПХПАХХПХПАПХАХПХРРХХАПХАПХПХАХПХПА)))))))))')
elif e == 9:
    print('Ты немного слепой кажись. Там яма с фаллоимитаторами. Научись играть боже.')
elif e == 8:
    print('Ты как я понял умный и ты можешь смотреть на БДСМ с Алексеем в роли жертвы')
    print('Вот ссылка на него ------ https://disk.yandex.ru/i/Dv4eVAfJjsUrJQ')
